// Задача 19: Напишите программу, которая принимает на
// вход пятизначное число и проверяет, является ли оно
// палиндромом.

int[] array = { 1, 2, 3, 2, 1 };
int i = 0;
int N = array.Length;

Console.WriteLine("Является ли пятизначное число палиндромом?");

if (array[i] == array[(N - 1)] & (array[i] + 1) == array[(N - 2)])
{
    Console.Write("Да");
}
else
{
    Console.Write("Нет");
}










// Задача 21: Напишите программу, которая принимает на
// вход координаты двух точек и находит расстояние между
// ними в 3D пространстве.




// Задача 23: Напишите программу, которая принимает на
// вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
