/* Напишите программу, которая на вход принимает
одно число (N), а на выходе показывает все целые
числа в промежутке от -N до N. */

/*  Console.WriteLine("Введите число");
int N = int.Parse(Console.ReadLine());
int i = -N;
while (i <= N)
{
    Console.Write (i + " ");
    i++;
} */

/* Напишите  программу, которая принимает на вход
трёхзначное число и на выходе показывает последнюю цифру
этого числа. */

/* Console.WriteLine("Введите число");
int A = int.Parse(Console.ReadLine());
if ((99 < A) & (A < 1000))
{
    Console.WriteLine(A%10);
}
else Console.WriteLine("Не правильно введено число"); */